{
    "leftContent": {
      "title": "Metapath-Free Heterogeneous Network Embedding via Heterogeneous Adjacency Matrix Reconstruction Based Mask Graph Autoencoders and Semantic Relation Aggregation",
      "subtitle":"Proceedings of the IEEE/ACM International Conference on Data Science and Advanced Analytics (DSAA 2025). (Acceptance Rate: 37.61%)",
      "description": "Heterogeneous graph embedding has recently advanced with two primary directions: self-supervised learning to address the scarcity of labeled data and metapath-free approaches to eliminate reliance on handcrafted, domain-specific metapaths. While metapath-free methods capture structural and semantic information directly from neighbor relationships, their performance often remains unstable across datasets and varying label scales, as they still rely on semi-supervised training. Conversely, self-supervised learning methods, including contrastive strategies and masked graph autoencoders, achieve remarkable results by extracting information intrinsically from the data. However, these approaches often depend on predefined metapaths, which limit their ability to generalize and constrain representation quality. This paper proposes Relation-aware Heterogeneous Masked Graph Autoencoder (RHMGA), a novel metapath-free self-supervised learning framework that bridges these gaps. Our method integrates a semantic relation network with masked graph autoencoders to jointly reconstruct node features and relation-specific adjacency matrices. By capturing both structural and semantic information during aggregation and reconstruction, RHMGA enables robust self-supervised pretraining without predefined metapaths. Extensive experiments demonstrate that our approach consistently outperforms state-of-the-art methods, achieving superior performance and adaptability across diverse heterogeneous graph datasets.",
      "url":"https://dsaa.ieee.org/2025/technical-program/"
    },
    "images": [
      {
        "src": "/images/thesis/HG_embedding.png",
        "alt": "Heterogeneous Graph Embedding",
        "url":""
      },
      {
        "src": "/images/thesis/framework_conference.png",
        "alt": "Framework",
        "url":""
      },
      {
        "src": "/images/thesis/RAN.png",
        "alt": "SRN",
        "url":""
      },
      {
        "src": "/images/thesis/relation_adj.png",
        "alt": "Relation Adjacent Matrix Reconstruction",
        "url":""
      }
    ]
  }